# DiameterDimensionTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..DiameterDimensionTypeId Property
RebarBendingDetailType Class See Also
---
Identifies the Id of the diameter dimension type which is used to show dimensions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId DiameterDimensionTypeId { get; set; }
```

Visual Basic
---
```text
Public Property DiameterDimensionTypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ DiameterDimensionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace